SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_msc.h
/**************************************************************************//**
 * @file
 * @brief EFM32PG28 MSC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFM32PG28_MSC_H
#define EFM32PG28_MSC_H

#define MSC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFM32PG28_MSC MSC
 * @{
 * @brief EFM32PG28 MSC Register Declaration.
 *****************************************************************************/

/** MSC Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
  __IOM uint32_t             READCTRL;               /**< Read Control Register                              */
  __IOM uint32_t             RDATACTRL;              /**< Read Data Control Register                         */
  __IOM uint32_t             WRITECTRL;              /**< Write Control Register                             */
  __IOM uint32_t             WRITECMD;               /**< Write Command Register                             */
  __IOM uint32_t             ADDRB;                  /**< Page Erase/Write Address Buffer                    */
  __IOM uint32_t             WDATA;                  /**< Write Data Register                                */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
        uint32_t             RESERVED0[3U];          /**< Reserved for future use                            */
  __IM  uint32_t             USERDATASIZE;           /**< User Data Region Size Register                     */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IOM uint32_t             LOCK;                   /**< Configuration Lock Register                        */
  __IOM uint32_t             MISCLOCKWORD;           /**< Mass erase and User data page lock word            */
        uint32_t             RESERVED1[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             PWRCTRL;                /**< Power control register                             */
        uint32_t             RESERVED2[51U];    /**< Reserved for future use                            */
  __IOM uint32_t             PAGELOCK0;              /**< Main space page 0-31 lock word                     */
  __IOM uint32_t             PAGELOCK1;              /**< Main space page 32-63 lock word                    */
  __IOM uint32_t             PAGELOCK2;              /**< Main space page 64-95 lock word                    */
  __IOM uint32_t             PAGELOCK3;              /**< Main space page 96-127 lock word                   */
        uint32_t             RESERVED3[4U];     /**< Reserved for future use                            */
        uint32_t             RESERVED4[4U];          /**< Reserved for future use                            */
        uint32_t             RESERVED5[4U];     /**< Reserved for future use                            */
        uint32_t             RESERVED6[4U];          /**< Reserved for future use                            */
        uint32_t             RESERVED7[12U];    /**< Reserved for future use                            */
        uint32_t             RESERVED8[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED9[8U];     /**< Reserved for future use                            */
        uint32_t             RESERVED10[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED11[910U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
  __IOM uint32_t             READCTRL_SET;           /**< Read Control Register                              */
  __IOM uint32_t             RDATACTRL_SET;          /**< Read Data Control Register                         */
  __IOM uint32_t             WRITECTRL_SET;          /**< Write Control Register                             */
  __IOM uint32_t             WRITECMD_SET;           /**< Write Command Register                             */
  __IOM uint32_t             ADDRB_SET;              /**< Page Erase/Write Address Buffer                    */
  __IOM uint32_t             WDATA_SET;              /**< Write Data Register                                */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED12[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             USERDATASIZE_SET;       /**< User Data Region Size Register                     */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IOM uint32_t             LOCK_SET;               /**< Configuration Lock Register                        */
  __IOM uint32_t             MISCLOCKWORD_SET;       /**< Mass erase and User data page lock word            */
        uint32_t             RESERVED13[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PWRCTRL_SET;            /**< Power control register                             */
        uint32_t             RESERVED14[51U];   /**< Reserved for future use                            */
  __IOM uint32_t             PAGELOCK0_SET;          /**< Main space page 0-31 lock word                     */
  __IOM uint32_t             PAGELOCK1_SET;          /**< Main space page 32-63 lock word                    */
  __IOM uint32_t             PAGELOCK2_SET;          /**< Main space page 64-95 lock word                    */
  __IOM uint32_t             PAGELOCK3_SET;          /**< Main space page 96-127 lock word                   */
        uint32_t             RESERVED15[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED16[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED17[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED18[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED19[12U];   /**< Reserved for future use                            */
        uint32_t             RESERVED20[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED21[8U];    /**< Reserved for future use                            */
        uint32_t             RESERVED22[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED23[910U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
  __IOM uint32_t             READCTRL_CLR;           /**< Read Control Register                              */
  __IOM uint32_t             RDATACTRL_CLR;          /**< Read Data Control Register                         */
  __IOM uint32_t             WRITECTRL_CLR;          /**< Write Control Register                             */
  __IOM uint32_t             WRITECMD_CLR;           /**< Write Command Register                             */
  __IOM uint32_t             ADDRB_CLR;              /**< Page Erase/Write Address Buffer                    */
  __IOM uint32_t             WDATA_CLR;              /**< Write Data Register                                */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED24[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             USERDATASIZE_CLR;       /**< User Data Region Size Register                     */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IOM uint32_t             LOCK_CLR;               /**< Configuration Lock Register                        */
  __IOM uint32_t             MISCLOCKWORD_CLR;       /**< Mass erase and User data page lock word            */
        uint32_t             RESERVED25[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PWRCTRL_CLR;            /**< Power control register                             */
        uint32_t             RESERVED26[51U];   /**< Reserved for future use                            */
  __IOM uint32_t             PAGELOCK0_CLR;          /**< Main space page 0-31 lock word                     */
  __IOM uint32_t             PAGELOCK1_CLR;          /**< Main space page 32-63 lock word                    */
  __IOM uint32_t             PAGELOCK2_CLR;          /**< Main space page 64-95 lock word                    */
  __IOM uint32_t             PAGELOCK3_CLR;          /**< Main space page 96-127 lock word                   */
        uint32_t             RESERVED27[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED28[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED29[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED30[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED31[12U];   /**< Reserved for future use                            */
        uint32_t             RESERVED32[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED33[8U];    /**< Reserved for future use                            */
        uint32_t             RESERVED34[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED35[910U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
  __IOM uint32_t             READCTRL_TGL;           /**< Read Control Register                              */
  __IOM uint32_t             RDATACTRL_TGL;          /**< Read Data Control Register                         */
  __IOM uint32_t             WRITECTRL_TGL;          /**< Write Control Register                             */
  __IOM uint32_t             WRITECMD_TGL;           /**< Write Command Register                             */
  __IOM uint32_t             ADDRB_TGL;              /**< Page Erase/Write Address Buffer                    */
  __IOM uint32_t             WDATA_TGL;              /**< Write Data Register                                */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED36[3U];         /**< Reserved for future use                            */
  __IM  uint32_t             USERDATASIZE_TGL;       /**< User Data Region Size Register                     */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IOM uint32_t             LOCK_TGL;               /**< Configuration Lock Register                        */
  __IOM uint32_t             MISCLOCKWORD_TGL;       /**< Mass erase and User data page lock word            */
        uint32_t             RESERVED37[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PWRCTRL_TGL;            /**< Power control register                             */
        uint32_t             RESERVED38[51U];   /**< Reserved for future use                            */
  __IOM uint32_t             PAGELOCK0_TGL;          /**< Main space page 0-31 lock word                     */
  __IOM uint32_t             PAGELOCK1_TGL;          /**< Main space page 32-63 lock word                    */
  __IOM uint32_t             PAGELOCK2_TGL;          /**< Main space page 64-95 lock word                    */
  __IOM uint32_t             PAGELOCK3_TGL;          /**< Main space page 96-127 lock word                   */
        uint32_t             RESERVED39[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED40[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED41[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED42[4U];         /**< Reserved for future use                            */
        uint32_t             RESERVED43[12U];   /**< Reserved for future use                            */
        uint32_t             RESERVED44[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED45[8U];    /**< Reserved for future use                            */
        uint32_t             RESERVED46[1U];         /**< Reserved for future use                            */
} MSC_TypeDef;
/** @} End of group EFM32PG28_MSC */

/**************************************************************************//**
 * @addtogroup EFM32PG28_MSC
 * @{
 * @defgroup EFM32PG28_MSC_BitFields MSC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MSC IPVERSION */
#define _MSC_IPVERSION_RESETVALUE               0x00000007UL                            /**< Default value for MSC_IPVERSION             */
#define _MSC_IPVERSION_MASK                     0xFFFFFFFFUL                            /**< Mask for MSC_IPVERSION                      */
#define _MSC_IPVERSION_IPVERSION_SHIFT          0                                       /**< Shift value for MSC_IPVERSION               */
#define _MSC_IPVERSION_IPVERSION_MASK           0xFFFFFFFFUL                            /**< Bit mask for MSC_IPVERSION                  */
#define _MSC_IPVERSION_IPVERSION_DEFAULT        0x00000007UL                            /**< Mode DEFAULT for MSC_IPVERSION              */
#define MSC_IPVERSION_IPVERSION_DEFAULT         (_MSC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IPVERSION      */

/* Bit fields for MSC READCTRL */
#define _MSC_READCTRL_RESETVALUE                0x00200000UL                            /**< Default value for MSC_READCTRL              */
#define _MSC_READCTRL_MASK                      0x00300000UL                            /**< Mask for MSC_READCTRL                       */
#define _MSC_READCTRL_MODE_SHIFT                20                                      /**< Shift value for MSC_MODE                    */
#define _MSC_READCTRL_MODE_MASK                 0x300000UL                              /**< Bit mask for MSC_MODE                       */
#define _MSC_READCTRL_MODE_DEFAULT              0x00000002UL                            /**< Mode DEFAULT for MSC_READCTRL               */
#define _MSC_READCTRL_MODE_WS0                  0x00000000UL                            /**< Mode WS0 for MSC_READCTRL                   */
#define _MSC_READCTRL_MODE_WS1                  0x00000001UL                            /**< Mode WS1 for MSC_READCTRL                   */
#define _MSC_READCTRL_MODE_WS2                  0x00000002UL                            /**< Mode WS2 for MSC_READCTRL                   */
#define _MSC_READCTRL_MODE_WS3                  0x00000003UL                            /**< Mode WS3 for MSC_READCTRL                   */
#define MSC_READCTRL_MODE_DEFAULT               (_MSC_READCTRL_MODE_DEFAULT << 20)      /**< Shifted mode DEFAULT for MSC_READCTRL       */
#define MSC_READCTRL_MODE_WS0                   (_MSC_READCTRL_MODE_WS0 << 20)          /**< Shifted mode WS0 for MSC_READCTRL           */
#define MSC_READCTRL_MODE_WS1                   (_MSC_READCTRL_MODE_WS1 << 20)          /**< Shifted mode WS1 for MSC_READCTRL           */
#define MSC_READCTRL_MODE_WS2                   (_MSC_READCTRL_MODE_WS2 << 20)          /**< Shifted mode WS2 for MSC_READCTRL           */
#define MSC_READCTRL_MODE_WS3                   (_MSC_READCTRL_MODE_WS3 << 20)          /**< Shifted mode WS3 for MSC_READCTRL           */

/* Bit fields for MSC RDATACTRL */
#define _MSC_RDATACTRL_RESETVALUE               0x00001000UL                            /**< Default value for MSC_RDATACTRL             */
#define _MSC_RDATACTRL_MASK                     0x00001002UL                            /**< Mask for MSC_RDATACTRL                      */
#define MSC_RDATACTRL_AFDIS                     (0x1UL << 1)                            /**< Automatic Invalidate Disable                */
#define _MSC_RDATACTRL_AFDIS_SHIFT              1                                       /**< Shift value for MSC_AFDIS                   */
#define _MSC_RDATACTRL_AFDIS_MASK               0x2UL                                   /**< Bit mask for MSC_AFDIS                      */
#define _MSC_RDATACTRL_AFDIS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for MSC_RDATACTRL              */
#define MSC_RDATACTRL_AFDIS_DEFAULT             (_MSC_RDATACTRL_AFDIS_DEFAULT << 1)     /**< Shifted mode DEFAULT for MSC_RDATACTRL      */
#define MSC_RDATACTRL_DOUTBUFEN                 (0x1UL << 12)                           /**< Flash dout pipeline buffer enable           */
#define _MSC_RDATACTRL_DOUTBUFEN_SHIFT          12                                      /**< Shift value for MSC_DOUTBUFEN               */
#define _MSC_RDATACTRL_DOUTBUFEN_MASK           0x1000UL                                /**< Bit mask for MSC_DOUTBUFEN                  */
#define _MSC_RDATACTRL_DOUTBUFEN_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for MSC_RDATACTRL              */
#define MSC_RDATACTRL_DOUTBUFEN_DEFAULT         (_MSC_RDATACTRL_DOUTBUFEN_DEFAULT << 12) /**< Shifted mode DEFAULT for MSC_RDATACTRL      */

/* Bit fields for MSC WRITECTRL */
#define _MSC_WRITECTRL_RESETVALUE               0x00000000UL                            /**< Default value for MSC_WRITECTRL             */
#define _MSC_WRITECTRL_MASK                     0x03FF000BUL                            /**< Mask for MSC_WRITECTRL                      */
#define MSC_WRITECTRL_WREN                      (0x1UL << 0)                            /**< Enable Write/Erase Controller               */
#define _MSC_WRITECTRL_WREN_SHIFT               0                                       /**< Shift value for MSC_WREN                    */
#define _MSC_WRITECTRL_WREN_MASK                0x1UL                                   /**< Bit mask for MSC_WREN                       */
#define _MSC_WRITECTRL_WREN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECTRL              */
#define MSC_WRITECTRL_WREN_DEFAULT              (_MSC_WRITECTRL_WREN_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_WRITECTRL      */
#define MSC_WRITECTRL_IRQERASEABORT             (0x1UL << 1)                            /**< Abort Page Erase on Interrupt               */
#define _MSC_WRITECTRL_IRQERASEABORT_SHIFT      1                                       /**< Shift value for MSC_IRQERASEABORT           */
#define _MSC_WRITECTRL_IRQERASEABORT_MASK       0x2UL                                   /**< Bit mask for MSC_IRQERASEABORT              */
#define _MSC_WRITECTRL_IRQERASEABORT_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECTRL              */
#define MSC_WRITECTRL_IRQERASEABORT_DEFAULT     (_MSC_WRITECTRL_IRQERASEABORT_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_WRITECTRL      */
#define MSC_WRITECTRL_LPWRITE                   (0x1UL << 3)                            /**< Low-Power Write                             */
#define _MSC_WRITECTRL_LPWRITE_SHIFT            3                                       /**< Shift value for MSC_LPWRITE                 */
#define _MSC_WRITECTRL_LPWRITE_MASK             0x8UL                                   /**< Bit mask for MSC_LPWRITE                    */
#define _MSC_WRITECTRL_LPWRITE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECTRL              */
#define MSC_WRITECTRL_LPWRITE_DEFAULT           (_MSC_WRITECTRL_LPWRITE_DEFAULT << 3)   /**< Shifted mode DEFAULT for MSC_WRITECTRL      */
#define _MSC_WRITECTRL_RANGECOUNT_SHIFT         16                                      /**< Shift value for MSC_RANGECOUNT              */
#define _MSC_WRITECTRL_RANGECOUNT_MASK          0x3FF0000UL                             /**< Bit mask for MSC_RANGECOUNT                 */
#define _MSC_WRITECTRL_RANGECOUNT_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECTRL              */
#define MSC_WRITECTRL_RANGECOUNT_DEFAULT        (_MSC_WRITECTRL_RANGECOUNT_DEFAULT << 16) /**< Shifted mode DEFAULT for MSC_WRITECTRL      */

