SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_msc.h
/* Bit fields for MSC WRITECMD */
#define _MSC_WRITECMD_RESETVALUE                0x00000000UL                            /**< Default value for MSC_WRITECMD              */
#define _MSC_WRITECMD_MASK                      0x00001136UL                            /**< Mask for MSC_WRITECMD                       */
#define MSC_WRITECMD_ERASEPAGE                  (0x1UL << 1)                            /**< Erase Page                                  */
#define _MSC_WRITECMD_ERASEPAGE_SHIFT           1                                       /**< Shift value for MSC_ERASEPAGE               */
#define _MSC_WRITECMD_ERASEPAGE_MASK            0x2UL                                   /**< Bit mask for MSC_ERASEPAGE                  */
#define _MSC_WRITECMD_ERASEPAGE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_ERASEPAGE_DEFAULT          (_MSC_WRITECMD_ERASEPAGE_DEFAULT << 1)  /**< Shifted mode DEFAULT for MSC_WRITECMD       */
#define MSC_WRITECMD_WRITEEND                   (0x1UL << 2)                            /**< End Write Mode                              */
#define _MSC_WRITECMD_WRITEEND_SHIFT            2                                       /**< Shift value for MSC_WRITEEND                */
#define _MSC_WRITECMD_WRITEEND_MASK             0x4UL                                   /**< Bit mask for MSC_WRITEEND                   */
#define _MSC_WRITECMD_WRITEEND_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_WRITEEND_DEFAULT           (_MSC_WRITECMD_WRITEEND_DEFAULT << 2)   /**< Shifted mode DEFAULT for MSC_WRITECMD       */
#define MSC_WRITECMD_ERASERANGE                 (0x1UL << 4)                            /**< Erase range of pages                        */
#define _MSC_WRITECMD_ERASERANGE_SHIFT          4                                       /**< Shift value for MSC_ERASERANGE              */
#define _MSC_WRITECMD_ERASERANGE_MASK           0x10UL                                  /**< Bit mask for MSC_ERASERANGE                 */
#define _MSC_WRITECMD_ERASERANGE_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_ERASERANGE_DEFAULT         (_MSC_WRITECMD_ERASERANGE_DEFAULT << 4) /**< Shifted mode DEFAULT for MSC_WRITECMD       */
#define MSC_WRITECMD_ERASEABORT                 (0x1UL << 5)                            /**< Abort erase sequence                        */
#define _MSC_WRITECMD_ERASEABORT_SHIFT          5                                       /**< Shift value for MSC_ERASEABORT              */
#define _MSC_WRITECMD_ERASEABORT_MASK           0x20UL                                  /**< Bit mask for MSC_ERASEABORT                 */
#define _MSC_WRITECMD_ERASEABORT_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_ERASEABORT_DEFAULT         (_MSC_WRITECMD_ERASEABORT_DEFAULT << 5) /**< Shifted mode DEFAULT for MSC_WRITECMD       */
#define MSC_WRITECMD_ERASEMAIN0                 (0x1UL << 8)                            /**< Mass erase region 0                         */
#define _MSC_WRITECMD_ERASEMAIN0_SHIFT          8                                       /**< Shift value for MSC_ERASEMAIN0              */
#define _MSC_WRITECMD_ERASEMAIN0_MASK           0x100UL                                 /**< Bit mask for MSC_ERASEMAIN0                 */
#define _MSC_WRITECMD_ERASEMAIN0_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_ERASEMAIN0_DEFAULT         (_MSC_WRITECMD_ERASEMAIN0_DEFAULT << 8) /**< Shifted mode DEFAULT for MSC_WRITECMD       */
#define MSC_WRITECMD_CLEARWDATA                 (0x1UL << 12)                           /**< Clear WDATA state                           */
#define _MSC_WRITECMD_CLEARWDATA_SHIFT          12                                      /**< Shift value for MSC_CLEARWDATA              */
#define _MSC_WRITECMD_CLEARWDATA_MASK           0x1000UL                                /**< Bit mask for MSC_CLEARWDATA                 */
#define _MSC_WRITECMD_CLEARWDATA_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MSC_WRITECMD               */
#define MSC_WRITECMD_CLEARWDATA_DEFAULT         (_MSC_WRITECMD_CLEARWDATA_DEFAULT << 12) /**< Shifted mode DEFAULT for MSC_WRITECMD       */

/* Bit fields for MSC ADDRB */
#define _MSC_ADDRB_RESETVALUE                   0x00000000UL                            /**< Default value for MSC_ADDRB                 */
#define _MSC_ADDRB_MASK                         0xFFFFFFFFUL                            /**< Mask for MSC_ADDRB                          */
#define _MSC_ADDRB_ADDRB_SHIFT                  0                                       /**< Shift value for MSC_ADDRB                   */
#define _MSC_ADDRB_ADDRB_MASK                   0xFFFFFFFFUL                            /**< Bit mask for MSC_ADDRB                      */
#define _MSC_ADDRB_ADDRB_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for MSC_ADDRB                  */
#define MSC_ADDRB_ADDRB_DEFAULT                 (_MSC_ADDRB_ADDRB_DEFAULT << 0)         /**< Shifted mode DEFAULT for MSC_ADDRB          */

/* Bit fields for MSC WDATA */
#define _MSC_WDATA_RESETVALUE                   0x00000000UL                            /**< Default value for MSC_WDATA                 */
#define _MSC_WDATA_MASK                         0xFFFFFFFFUL                            /**< Mask for MSC_WDATA                          */
#define _MSC_WDATA_DATAW_SHIFT                  0                                       /**< Shift value for MSC_DATAW                   */
#define _MSC_WDATA_DATAW_MASK                   0xFFFFFFFFUL                            /**< Bit mask for MSC_DATAW                      */
#define _MSC_WDATA_DATAW_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for MSC_WDATA                  */
#define MSC_WDATA_DATAW_DEFAULT                 (_MSC_WDATA_DATAW_DEFAULT << 0)         /**< Shifted mode DEFAULT for MSC_WDATA          */

